Dlubal.RFEM5.ISolid
Interface for working with solid

Dlubal.RFEM5.ISolid.GetData
Gets solid parameters.
Returns: Solid parameters

Dlubal.RFEM5.ISolid.SetData(System.UInt32@)
Sets solid parameters.
Solid: Solid parameters

Dlubal.RFEM5.ISolid.Delete
Deletes solid.

Dlubal.RFEM5.ISolid.GetAxes
Gets solid axes parameters.
Returns: Solid axes parameters

Dlubal.RFEM5.ISolid.SetAxes(System.UInt32@)
Sets solid axes parameters.
Axes: Axis for results parameters